/*********************************************************************************
//概述：
//作者：大胡子书生     时间：       地点：
//CPU型号：         系统主频：
//版本号：V0.0        
*********************************************************************************/
#ifndef  __APP_GPRS_H
#define  __APP_GPRS_H 
/*********************************************************************************
文件包含区
*********************************************************************************/
#include "..\..\BSP\inc\MG2618.h"
/*********************************************************************************
宏定义区
*********************************************************************************/

#define  GRPS_ReconnectionTime   3   //（单位： 分钟）
#define  GRPS_PauseTime          30  //（单位： 分钟）
#define  LinkLedCycle            10  //(单位：  秒)
/*********************************************************************************
数据类型定义
*********************************************************************************/
typedef void (*GPRSLaunch_OK)(void);   
/*********************************************************************************
外部变量声明区
*********************************************************************************/
extern unsigned short    GprsStop_time  ;
extern unsigned short   LinkErr_time;
extern unsigned char     LinkLed_time ;
/*********************************************************************************
函数声明区
*********************************************************************************/
SystemErrName Reboot_MG2618 (GPRSLaunch_OK OK);
void GprsClose_UEV(unsigned char CH);


SystemErrName TCP_SendStart_MG2618(unsigned char ch,
                                   unsigned char *buff,
                                   unsigned short length,
                                   SerialPort_SendEndCallBack_Type callBack,
                                   void *callBack_arg);

unsigned char getIdleChannel_MG2618(void);
void freeChannel_MG2618(unsigned char ch);
void GprsConnect_OK(unsigned char CH, GprsInfr_Struct* Infr);
void  GprsGuarde_Process ( void );
/********************************************************************************/
#endif
/*************************************END****************************************/