/**********************************************************************************
//概述： 
//作者：大胡子书生      时间： 2011-06-27  16：30   地点：鼎科研发部
//CPU型号：    系统主频：
//版本号：
***********************************************************************************/
#ifndef  MODBUS_SLAVE_H
#define  MODBUS_SLAVE_H
/**********************************************************************************
文件包含区
***********************************************************************************/
#include "..\..\BSP\inc\BSP.h"
/**********************************************************************************
宏定义区
***********************************************************************************/
#define modbusslave_receBuf_Len  48
#define modbusslave_sendBuf_Len  48

//#define UART_TXRegister  USART1->DR     //串口发送数据寄存器
//#define UART_RXRegister  USART1->DR     //串口发送数据寄存器
/**********************************************************************************
数据类型定义区
***********************************************************************************/
 typedef struct  
  {
   unsigned short  Hword;
   unsigned short  Lword ;
  }Dword; 

typedef union 
{ 
  float  F;
  Dword  W;
  unsigned long  L; 
}_4byte_type;
/**********************************************************************************
外不变量声明区
***********************************************************************************/
//extern unsigned char localAddr ;	//本机地址；
/**********************************************************************************
函数声明区
***********************************************************************************/
SystemErrName Modbus_Input (unsigned char prot, void *pbuff, unsigned char length);
void modbus_10ms( void );
unsigned char UART_SendData( unsigned char* txbuf, unsigned char txnum );
//void checkComm0Modbus(void);
void Modbus_function ( void );
/***********************************************************************************/
#endif

