/*********************************************************************************
//概述：
//作者：大胡子书生     时间：       地点：
//CPU型号：         系统主频：
//版本号：V0.0        
*********************************************************************************/
#ifndef  __BSP_POWERDRIVER_H
#define  __BSP_POWERDRIVER_H 


/*********************************************************************************
文件包含区
*********************************************************************************/
#include ".\MCU_Config.h"
#include ".\SerialPort.h"
#include "..\..\Projects\inc\SystemDefine.h"
#include "..\..\Projects\inc\Common_API.h"
/*********************************************************************************
宏定义区
*********************************************************************************/


#define  ErthNet_PowerFlg        (ErthNet_ENpin)           
#define  ErthNet_PowerON( )      set_ErthNet_ENpin       
#define  ErthNet_PowerOFF( )     clr_ErthNet_ENpin      

#define  Wifi_PowerFlg           (Wifi_ENpin)              
#define  Wifi_PowerON( )         set_Wifi_ENpin          
#define  Wifi_PowerOFF( )        clr_Wifi_ENpin   



/*********************************************************************************
数据类型定义
*********************************************************************************/
/*********************************************************************************
外部变量声明区
*********************************************************************************/

/*********************************************************************************
函数声明区
*********************************************************************************/
void OFF_Rs232 (void);
void EthernetPowerON_Order (void);
void EthernetPowerOFF_Order (void);
void PowerOut_Cmd (CommPortNumber_Type channel, FunctionalState NewState);
FunctionalState getPowerOut_State (CommPortNumber_Type channel);
/********************************************************************************/
#endif













